Config/ChartsOfCharacteristicTypes/СвойстваОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>СвойстваОбъектов</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ГлавыПоБюджетнойКлассификации</v8:Type>
				<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
				<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодпрограммыЦелевыхСтатейКРБ</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
				<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
				<v8:Type>cfg:EnumRef.КВД</v8:Type>
				<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
				<v8:Type>cfg:CatalogRef.Субконто</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойств</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УточнениеТипа</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фиксированное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списковое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Config/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Субконто</v8:Type>
						<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/НазначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НазначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияСвойств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УточнениеНазначения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/НазначенияСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазначенияСвойств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субконто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидыОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрокиОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КолонкиОтчетов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/ChartsOfCharacteristicTypes/АналитикаОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>АналитикаОтчетов</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ГлавыПоБюджетнойКлассификации</v8:Type>
				<v8:Type>cfg:CatalogRef.ПрограммыЦелевыхСтатейКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыРасходовКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыКИФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыДоходовКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ЦелевыеСтатьиКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
				<v8:Type>cfg:CatalogRef.СубъектыРФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодгруппыКИФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодвидыКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.АналитическиеКодыКПС</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодпрограммыЦелевыхСтатейКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.РазделыПодразделыКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиПодстатьиКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодгруппыКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
				<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиКИФ</v8:Type>
				<v8:Type>cfg:EnumRef.КВД</v8:Type>
				<v8:Type>cfg:CatalogRef.Субконто</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодвидовКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
				<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>20</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконтоОсновной</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиЗначенийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСубконто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможностьРедактированияВПодчиненныхКонфигурациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатораБК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассификаторовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаВладелецКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаВладелецПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Config/ChartsOfCharacteristicTypes/СвойстваОбъектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Функция НайтиЗначенияСвойств(Ссылка, УчитыватьНаборСвойств) Экспорт
	
	Если Ссылка.Пустая() Тогда
		Возврат Ложь; 
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияСвойствОбъектов.Свойство
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой(); 
	
КонецФункции // ПроверитьВозможностьИзменения()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокВыбораТипа = Элементы.ТипЗначенийСписок.СписокВыбора;
	
	НачалоСписка 	= Новый СписокЗначений(); 
	КонецСписка 	= Новый СписокЗначений(); 
	
	МетаданныеТип = Объект.Ссылка.Метаданные().Тип;
	
	КвЧисла  = Новый КвалификаторыЧисла(МетаданныеТип.КвалификаторыЧисла.Разрядность,
	МетаданныеТип.КвалификаторыЧисла.РазрядностьДробнойЧасти, 
	МетаданныеТип.КвалификаторыЧисла.ДопустимыйЗнак);
	
	КвСтроки = Новый КвалификаторыСтроки(МетаданныеТип.КвалификаторыСтроки.Длина, 
	МетаданныеТип.КвалификаторыСтроки.ДопустимаяДлина);
	
	КвДаты   = Новый КвалификаторыДаты(МетаданныеТип.КвалификаторыДаты.ЧастиДаты);
	
	Для Каждого Тип Из МетаданныеТип.Типы() Цикл
		
		Типы = Новый Массив;
		Типы.Добавить(Тип);
		
		Если    Тип = Тип("Число")
			или Тип = Тип("Строка")
			или Тип = Тип("Дата") 
			или Тип = Тип("Булево") 
			Тогда
			
			ОписаниеТекущегоТипа      = Новый ОписаниеТипов(Типы, КвЧисла, КвСтроки, КвДаты);
			ПредставлениеТекущегоТипа = ""+Тип; 
			НачалоСписка.Добавить(ОписаниеТекущегоТипа, ПредставлениеТекущегоТипа);
			
		ИначеЕсли Тип = Тип("СправочникСсылка.ЗначенияСвойств") Тогда	
			
			ОписаниеТекущегоТипа      = Новый ОписаниеТипов(Типы);
			
			ПредставлениеТекущегоТипа = "Набор значений свойств"; 
			НачалоСписка.Добавить(ОписаниеТекущегоТипа, ПредставлениеТекущегоТипа);
			
		Иначе
			
			ОписаниеТекущегоТипа      = Новый ОписаниеТипов(Типы);
			
			ПредставлениеТекущегоТипа = СтрЗаменить(""+Тип, " ссылка", ""); 
			КонецСписка.Добавить(ОписаниеТекущегоТипа, ПредставлениеТекущегоТипа);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Для Каждого ОписаниеТекущегоТипа Из НачалоСписка Цикл
		СписокВыбораТипа.Добавить(ОписаниеТекущегоТипа.Значение, ОписаниеТекущегоТипа.Представление);
	КонецЦикла; 
	
	Для Каждого ОписаниеТекущегоТипа Из КонецСписка Цикл
		СписокВыбораТипа.Добавить(ОписаниеТекущегоТипа.Значение, ОписаниеТекущегоТипа.Представление);
	КонецЦикла; 
	
	
	Если Параметры.Ключ.Пустая() 
		//И Не ЭтоГруппа  
		И Параметры.ЗначениеКопирования = Неопределено Тогда
		
		Объект.Фиксированное = Истина; 
		Объект.ТипЗначения = СписокВыбораТипа.НайтиПоЗначению(Новый ОписаниеТипов("Строка", КвЧисла, КвСтроки, КвДаты)).Значение;
		
	КонецЕсли; 
	
	Для Каждого Элемент Из Элементы.ТипЗначенийСписок.СписокВыбора Цикл
		
		Если Строка(Объект.ТипЗначения) = Строка(Элемент.Значение) Тогда
			ТипЗначенийСписок = Элемент.Значение;
			Продолжить;
		КонецЕсли; 
		
	КонецЦикла;  
	
	//Автозаголовок = Ложь;
	//СформироватьЗаголовок();
	
	Если Не Параметры.Ключ.Пустая()
		И НайтиЗначенияСвойств(Объект.Ссылка, Истина) Тогда
		
		Элементы.ТипЗначенийСписок.ТолькоПросмотр = Истина;
		Элементы.УточнениеТипа.ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	Элементы.УточнениеТипа.ТолькоПросмотр = Истина;
	
	// Заполнение списка назначений
	
	// 1. Считаем уже установленные назначения
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенияСвойствОбъектов.НазначениеСвойства,
	|	НазначенияСвойствОбъектов.УточнениеНазначения
	|ИЗ
	|	РегистрСведений.НазначенияСвойствОбъектов КАК НазначенияСвойствОбъектов
	|ГДЕ
	|	НазначенияСвойствОбъектов.Свойство = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	
	УстановленныеНазначения = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ЭлементПеречисления Из Перечисления.НазначенияСвойств Цикл
		Если ЭлементПеречисления <> Перечисления.НазначенияСвойств.Субконто Тогда
			СтрокаТаблицы = ТаблицаНазначений.Добавить();
			СтрокаТаблицы.НазначениеСвойства = ЭлементПеречисления;
			Если УстановленныеНазначения.Найти(ЭлементПеречисления,"НазначениеСвойства") <> Неопределено Тогда
				СтрокаТаблицы.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикаОтчетов.Ссылка,
	|	АналитикаОтчетов.ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.АналитикаОтчетов КАК АналитикаОтчетов
	|ГДЕ
	|	АналитикаОтчетов.ЭтоГруппа = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ТипЗначения.Типы()[0] = Тип("СправочникСсылка.Субконто") Тогда
			СтрокаТаблицы = ТаблицаНазначений.Добавить();
			СтрокаТаблицы.НазначениеСвойства = Выборка.Ссылка;
			Если УстановленныеНазначения.Найти(Выборка.Ссылка,"УточнениеНазначения") <> Неопределено Тогда
				СтрокаТаблицы.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Ссылка <> ПланыВидовХарактеристик.СвойстваОбъектов.ПубличныйИдентификатор Тогда		
		ЭтаФорма.ТолькоПросмотр = Объект.Предопределенный;
		Элементы.ТипЗначенийСписок.ТолькоПросмотр = Объект.Предопределенный;
		Элементы.ТаблицаНазначений.ТолькоПросмотр = Объект.Предопределенный;
	КонецЕсли;
    Если Объект.ТипЗначения.Типы()[0] = Тип("СправочникСсылка.Субконто") Тогда
		Элементы.УточнениеТипа.ТолькоПросмотр            = Элементы.ТипЗначенийСписок.ТолькоПросмотр;    
		Элементы.УточнениеТипа.АвтоОтметкаНезаполненного = Истина;    
	Иначе
		Элементы.УточнениеТипа.АвтоОтметкаНезаполненного = Ложь;    
		Элементы.УточнениеТипа.ОтметкаНезаполненного     = Ложь;    
		Элементы.УточнениеТипа.ТолькоПросмотр            = Истина;    
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НаборНазначений = РегистрыСведений.НазначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборНазначений.Отбор.Свойство.Установить(Объект.Ссылка);
	НаборНазначений.Прочитать();
	НаборНазначений.Очистить();
	
	Для Каждого СтрНазначений Из ТаблицаНазначений Цикл
		
		Если СтрНазначений.Пометка Тогда
			
			Запись = НаборНазначений.Добавить();
			Запись.Свойство = Объект.Ссылка;
			Если ТипЗнч(СтрНазначений.НазначениеСвойства) = Тип("ПеречислениеСсылка.НазначенияСвойств") Тогда
				Запись.НазначениеСвойства = СтрНазначений.НазначениеСвойства;
			Иначе
				
				Запись.НазначениеСвойства  = Перечисления.НазначенияСвойств.Субконто;
				Запись.УточнениеНазначения = СтрНазначений.НазначениеСвойства;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборНазначений.Записать();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ


&НаСервереБезКонтекста
Функция СтрокаМожетИспользоватьсяВКачествеКода(Знач Текст)

	Возврат БюджетнаяОтчетность.СтрокаМожетИспользоватьсяВКачествеКода(Текст);

КонецФункции // СтрокаМожетИспользоватьсяВКачествеКода()


&НаКлиенте
Процедура ТипЗначенийСписокПриИзменении(Элемент)
	
	Объект.ТипЗначения = ТипЗначенийСписок;
	
	Если Не Объект.ТипЗначения.Типы()[0] = Тип("СправочникСсылка.Субконто") 
		и ЗначениеЗаполнено(Объект.УточнениеТипа) Тогда
		
		Объект.УточнениеТипа = "";
		
	КонецЕсли; 
	
	Если Объект.ТипЗначения.Типы()[0] = Тип("СправочникСсылка.Субконто") Тогда
		Элементы.УточнениеТипа.ТолькоПросмотр            = Элементы.ТипЗначенийСписок.ТолькоПросмотр;    
		Элементы.УточнениеТипа.АвтоОтметкаНезаполненного = Истина;    
	Иначе
		Элементы.УточнениеТипа.АвтоОтметкаНезаполненного = Ложь;    
		Элементы.УточнениеТипа.ОтметкаНезаполненного     = Ложь;    
		Элементы.УточнениеТипа.ТолькоПросмотр            = Истина;    
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ СтрокаМожетИспользоватьсяВКачествеКода(Текст) Тогда
		ПоказатьПредупреждение(,Нстр("ru='Неверно задан код!'"));
		СтандартнаяОбработка = Ложь;
		Возврат;		
	КонецЕсли;
	
	Объект.Код = Текст;
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = БюджетнаяОтчетностьКлиентСервер.Синоним(Текст);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СоставНабораЗначенийНажатие(Команда)
	
	Если Не Объект.ТипЗначения.Типы()[0] = Тип("СправочникСсылка.ЗначенияСвойств") Тогда
		ТекстПредупреждения = НСтр("ru = 'Настройка значений возможна только для свойств с типом значения <Набор значений свойств>!'");
		ПоказатьПредупреждение(,ТекстПредупреждения); 
		Возврат; 
	КонецЕсли; 
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ПараметрыФормы = Новый Структура("Отбор",Новый Структура("Владелец",Объект.Ссылка));
		ОткрытьФорму("Справочник.ЗначенияСвойств.ФормаВыбора",ПараметрыФормы,ЭтаФорма,ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник","СоставНабораЗначенийНажатие");	
	
	ДополнительныеПараметры.Вставить("Владелец",Объект.Ссылка);
	
	ТекстВопроса = НСтр("ru = 'Элемент справочника не записан. Записать?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаВопроса",ЭтаФорма,ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , , , );

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРезультатаВопроса(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ДополнительныеПараметры.Источник = "СоставНабораЗначенийНажатие" Тогда 
		
		Если Результат = КодВозвратаДиалога.Да Тогда 
			
			УспехЗаписи = Записать();
			
			Если УспехЗаписи = Ложь Тогда 
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура("Отбор",Новый Структура("Владелец",ДополнительныеПараметры.Владелец));
			ОткрытьФорму("Справочник.ЗначенияСвойств.ФормаВыбора",ПараметрыФормы,ЭтаФорма,ЭтаФорма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
